



DetNet                                                          B. Varga
Internet-Draft                                                 J. Farkas
Intended status: Informational                                  Ericsson
Expires: December 8, 2021                                   June 6, 2021


 Deterministic Networking (DetNet): OAM Functions for The Service Sub-
                                 Layer
              draft-varga-detnet-service-sub-layer-oam-00

Abstract

   Operation, Administration, and Maintenance (OAM) tools are essential
   for a deterministic network.  The DetNet architecture [RFC8655] has
   defined two sub-layers: (1) DetNet service sub-layer and (2) DetNet
   forwarding sub-layer.  OAM mechanisms exist for the DetNet forwarding
   sub-layer, nonetheless, OAM for the service sub-layer requires a new
   mechanism.  This draft introduces OAM related procedures for the
   DetNet service sub-layer functions.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on December 8, 2021.

Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must



Varga & Farkas          Expires December 8, 2021                [Page 1]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3
     2.1.  Terms Used in This Document . . . . . . . . . . . . . . .   3
     2.2.  Abbreviations . . . . . . . . . . . . . . . . . . . . . .   3
     2.3.  Requirements Language . . . . . . . . . . . . . . . . . .   3
   3.  Requirements on OAM for DetNet Service Sub-layer  . . . . . .   4
   4.  DetNet PING . . . . . . . . . . . . . . . . . . . . . . . . .   4
     4.1.  Overview  . . . . . . . . . . . . . . . . . . . . . . . .   4
     4.2.  OAM processing at the DetNet service sub-layer  . . . . .   5
       4.2.1.  Relay node with PRF . . . . . . . . . . . . . . . . .   5
       4.2.2.  Relay node with PEF . . . . . . . . . . . . . . . . .   6
       4.2.3.  Relay node with POF . . . . . . . . . . . . . . . . .   6
       4.2.4.  Relay node without PREOF  . . . . . . . . . . . . . .   7
   5.  Security Considerations . . . . . . . . . . . . . . . . . . .   7
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7
   7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   8
     7.1.  Normative References  . . . . . . . . . . . . . . . . . .   8
     7.2.  Informative References  . . . . . . . . . . . . . . . . .   8
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   9

1.  Introduction

   The DetNet Working Group has defined two sub-layers: (1) DetNet
   service sub-layer, at which a DetNet service (e.g., service
   protection) is provided and (2) DetNet forwarding sub-layer, which
   optionally provides resource allocation for DetNet flows over paths
   provided by the underlying network.  In [RFC8655] new DetNet-specific
   functions have been defined for the DetNet service sub-layer, namely
   PREOF (a collective name for Packet Replication, Elimination, and
   Ordering Functions).

   Framework of Operations, Administration and Maintenance (OAM) for
   Deterministic Networking (DetNet) is described in
   [I-D.ietf-detnet-oam-framework].  OAM for the DetNet MPLS data plane
   is described in [I-D.ietf-detnet-mpls-oam] and OAM for the DetNet IP
   data plane is described in [I-D.ietf-detnet-mpls-oam].

   This draft has been submitted as an individual contribution to OAM
   discussions, in particular, to kick-off Working Group discussions on
   introducing OAM functions for the DetNet service sub-layer.  It is
   also up to the Working Group discussions to which draft parts of this
   contribution may go, if any.



Varga & Farkas          Expires December 8, 2021                [Page 2]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


   The OAM functions for the DetNet service sub-layer allow, for
   example, to recognize/discover DetNet relay nodes, to get information
   about their configuration, and to check their operation or status.

   The approach described in this draft introduces a new OAM shim layer
   to achieve OAM for the DetNet service sub-layer.  In the rest of the
   draft, this approach is referred to as "DetNet PING", which is an in-
   band OAM approach, i.e., the OAM packets follow precisely the same
   path as the data packets of the corresponding DetNet flow(s) The OAM
   packets provide DetNet service sub-layer specific information, like:

   o  Identity of a DetNet service sub-layer node.

   o  Discover Ingress/Egress flow specific configuration of a DetNet
      service sub-layer node.

   o  Detect the status of the flow specific service sub-layer function.

   DetNet PING is applicable both to IP and MPLS DetNet data planes.

2.  Terminology

2.1.  Terms Used in This Document

   This document uses the terminology established in the DetNet
   architecture [RFC8655], and the reader is assumed to be familiar with
   that document and its terminology.

2.2.  Abbreviations

   The following abbreviations are used in this document:

   DetNet        Deterministic Networking.

   PEF           Packet Elimination Function.

   POF           Packet Ordering Function.

   PREOF         Packet Replication, Elimination and Ordering Functions.

   PRF           Packet Replication Function.

2.3.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP




Varga & Farkas          Expires December 8, 2021                [Page 3]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

3.  Requirements on OAM for DetNet Service Sub-layer

   The requirements on OAM for a DetNet relay node are:

   1.  to provide OAM functions for the DetNet service sub-layer.

   2.  to discover DetNet relay nodes in a DetNet network.

   3.  to collect DetNet service sub-layer specific (e.g.,
       configuration/operation/status) information from DetNet relay
       nodes.

   4.  to work for both DetNet data planes: (1) MPLS and (2) IP.

4.  DetNet PING

4.1.  Overview

   The "DetNet PING" approach uses two types of OAM packets: (1) DetNet-
   Echo-Request and (2) DetNet-Echo-Reply.  Their encapsulation is
   identical to that of the corresponding DetNet data flow, so they
   follow precisely the same path as the packets of the corresponding
   DetNet data flow.  They target DetNet service sub-layer entities, so
   they may not be recognized as OAM packet by entities not implementing
   DetNet service sub-layer for a packet flow (e.g., transit nodes).
   Other entities treat them as packets belonging to the corresponding
   DetNet data flow.

   The following relay node roles can be distinguished:

   1.  DetNet PING originator node,

   2.  Intermediate DetNet service sub-layer node,

   3.  DetNet PING targeted node.

   An originator node sends (generates) DetNet-Echo-Request packet(s).
   DetNet-Echo-Request packet contains an OAM specific "PINGSeqNum",
   what can be used by the DetNet service sub-layer of relay nodes.
   Note that "PINGSeqNum" is originator specific.

   An intermediate DetNet service sub-layer node executes DetNet flow
   specific service sub-layer functionality.  Packet processing may be
   done in an OAM specific manner (see details in in Section 4.2).




Varga & Farkas          Expires December 8, 2021                [Page 4]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


   A targeted node answers with DetNet-Echo-Reply packet for each
   DetNet-Echo-Request.  DetNet-Echo-Reply packet provides DetNet
   service sub-layer specific information on (i) identities of DetNet
   service sub-layer node (e.g., Node-ID, local Flow-ID), (ii) ingress/
   egress flow related configuration (e.g., in/out member flow specific
   information (including forwarding sub-layer specifics)), and (iii)
   status of service sub-layer function (e.g., local PxF-ID, Action-
   Type=x, operational status, value of key state variable(s), function
   related counters).

4.2.  OAM processing at the DetNet service sub-layer

   Detailed OAM packet processing rules of various DetNet relay nodes
   are described in the next sections.

4.2.1.  Relay node with PRF

   A DetNet relay node with PRF processes DetNet OAM packets in a
   stateless manner.

   If the relay node with PRF is the target of a DetNet-Echo-Request
   packet, then the DetNet-Echo-Request packet MUST NOT be further
   forwarded and an DetNet-Echo-Reply packet MUST be generated.  If the
   relay node with PRF is not the target of a DetNet-Echo-Request
   packet, then the DetNet-Echo-Request packet MUST be sent over all
   DetNet flow specific member flow paths (i.e., it is replicated).

   A DetNet-Echo-Reply packet MUST contain the following information:

   o  Identities related to the DetNet service sub-layer node (e.g.,
      Node-ID, local Flow-ID),

   o  Ingress/Egress flow related configuration (e.g., in/out member
      flow specific information (including forwarding sub-layer
      specifics)),

   o  Status of service sub-layer function (e.g., local PRF-ID, Action-
      Type=Replication, operational status, value of the flow related
      key state variable (e.g., "GenSeqNum" in [IEEE8021CB]).

   A DetNet-Echo-Reply packet MAY contain the following information:

   o  PRF function related local counters.








Varga & Farkas          Expires December 8, 2021                [Page 5]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


4.2.2.  Relay node with PEF

   A DetNet relay node with PEF processes DetNet OAM packets in a
   stateful manner.

   If the relay node with PEF is the target of DetNet-Echo-Request
   packet, then the DetNet-Echo-Request packet MUST NOT be further
   forwarded and an DetNet-Echo-Reply packet MUST be generated.  If the
   relay node with PEF is not the target of DetNet-Echo-Request packet,
   then elimination MUST be executed on the DetNet-Echo-Request
   packet(s) using the OAM specific "PINGSeqNum" in the packet.  So only
   a single DetNet-Echo-Request packet is forwarded and all further
   replicas (having the same originator's sequence number) MUST be
   discarded.

   Note, that PEF MAY use a simplified elimination algorithm for DetNet-
   Echo-Request packets (e.g., "MatchRecoveryAlgorithm" in [IEEE8021CB])
   as OAM is a slow protocol.

   A DetNet-Echo-Reply packet MUST contain the following information:

   o  Identities related to the DetNet service sub-layer node (e.g.,
      Node-ID, local Flow-ID),

   o  Ingress/Egress flow related configuration (e.g., in/out member
      flow specific information (including forwarding sub-layer
      specifics)) ,

   o  Status of service sub-layer function (e.g., local PEF-ID, Action-
      Type=Elimination, operational status, value of the flow related
      key state variable (e.g., "RecovSeqNum" in [IEEE8021CB]).

   A DetNet-Echo-Reply packet MAY contain the following information:

   o  PEF function related local counters.

4.2.3.  Relay node with POF

   A DetNet relay node with POF processes DetNet OAM packets in a
   stateless manner.

   If the relay node with POF is the target of DetNet-Echo-Request
   packet, then the DetNet-Echo-Request packet MUST NOT be further
   forwarded and a DetNet-Echo-Reply packet MUST be generated.  If the
   relay node with POF is not the target of DetNet-Echo-Request packet,
   then the DetNet-Echo-Request packet(s) MUST be forwarded without any
   POF specific action.




Varga & Farkas          Expires December 8, 2021                [Page 6]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


   A DetNet-Echo-Reply packet MUST contain the following information:

   o  Identities of the DetNet service sub-layer node (e.g., Node-ID,
      local Flow-ID),

   o  Ingress/Egress flow related configuration (e.g., in/out member
      flow specific information (including forwarding sub-layer
      specifics)) ,

   o  Status of service sub-layer function (e.g., local POF-ID, Action-
      Type=Ordering, operational status, value of the flow related key
      state variable (e.g., "POFLastSent" in [I-D.varga-detnet-pof]).

   A DetNet-Echo-Reply packet MAY contain the following information:

   o  POF function related local counters.

4.2.4.  Relay node without PREOF

   A DetNet relay node without PREOF processes DetNet OAM packets in a
   stateless manner.

   If the relay node without PREOF is the target of DetNet-Echo-Request
   packet, then the DetNet-Echo-Request packet MUST NOT be further
   forwarded and an DetNet-Echo-Reply packet MUST be generated.  If the
   relay node without PREOF is not the target of DetNet-Echo-Request
   packet, then the DetNet-Echo-Request packet(s) MUST be forwarded (as
   any data packets of the related DetNet flow).

   DetNet-Echo-Reply packet MUST contain the following information:

   o  Identities of the DetNet service sub-layer node (e.g., Node-ID,
      local Flow-ID),

   o  Ingress/Egress flow related configuration (e.g., in/out member
      flow specific information (including forwarding sub-layer
      specifics)) .

5.  Security Considerations

   Tbd.

6.  IANA Considerations

   Tbd.






Varga & Farkas          Expires December 8, 2021                [Page 7]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


7.  References

7.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8655]  Finn, N., Thubert, P., Varga, B., and J. Farkas,
              "Deterministic Networking Architecture", RFC 8655,
              DOI 10.17487/RFC8655, October 2019,
              <https://www.rfc-editor.org/info/rfc8655>.

7.2.  Informative References

   [I-D.ietf-detnet-ip-oam]
              Mirsky, G., Chen, M., and D. Black, "Operations,
              Administration and Maintenance (OAM) for Deterministic
              Networks (DetNet) with IP Data Plane", draft-ietf-detnet-
              ip-oam-02 (work in progress), March 2021.

   [I-D.ietf-detnet-mpls-oam]
              Mirsky, G. and M. Chen, "Operations, Administration and
              Maintenance (OAM) for Deterministic Networks (DetNet) with
              MPLS Data Plane", draft-ietf-detnet-mpls-oam-03 (work in
              progress), March 2021.

   [I-D.ietf-detnet-oam-framework]
              Mirsky, G., Theoleyre, F., Papadopoulos, G. Z., and C. J.
              Bernardos, "Framework of Operations, Administration and
              Maintenance (OAM) for Deterministic Networking (DetNet)",
              draft-ietf-detnet-oam-framework-01 (work in progress), May
              2021.

   [I-D.varga-detnet-pof]
              Varga, B., Farkas, J., Kehrer, S., and T. Heer,
              "Deterministic Networking (DetNet): Packet Ordering
              Function", draft-varga-detnet-pof-00 (work in progress),
              April 2021.







Varga & Farkas          Expires December 8, 2021                [Page 8]

Internet-Draft        DetNet Service-Sub-layer OAM             June 2021


   [IEEE8021CB]
              IEEE, "IEEE Standard for Local and metropolitan area
              networks -- Frame Replication and Elimination for
              Reliability", DOI 10.1109/IEEESTD.2017.8091139, October
              2017,
              <https://standards.ieee.org/standard/802_1CB-2017.html>.

Authors' Addresses

   Balazs Varga
   Ericsson
   Magyar Tudosok krt. 11.
   Budapest  1117
   Hungary

   Email: balazs.a.varga@ericsson.com


   Janos Farkas
   Ericsson
   Magyar Tudosok krt. 11.
   Budapest  1117
   Hungary

   Email: janos.farkas@ericsson.com


























Varga & Farkas          Expires December 8, 2021                [Page 9]
